[
{
"eai:data": "<?xml version=\"1.0\"?>\n<view template=\"Splunk_TA_paloalto:templates/base.html\" type=\"html\" isDashboard=\"False\">\n    <label>Configuration</label>\n</view>",
"eai:type": "views",
"name": "configuration",
"owner": "nobody",
"sharing": "app"
},
{
"eai:data": "<form version=\"1.1\">\n  <label>Health</label>\n  <search id=\"basesearch\">\n    <query>\n      index=\"_internal\" source=\"/opt/splunk/var/log/splunk/splunk_ta_paloalto_cortex_xdr.log\" earliest=-2m \n      | search _raw=\"*XDR API Returned Successfully*\" OR _raw=\"*401 Client Error:*\" \n      | head 1 \n      | rex field=_raw \"Message: (?&lt;message&gt;.*)\" \n      | eval severity_level=if(like(message, \"401 Client Error%\"),\"3\",\"0\") \n      | eval Results=case(severity_level==\"3\", \"\u2757Invalid Cortex XDR API Key or ID\", severity_level==\"0\",\"\u2705 This health check item was successful.\", false(), \"\u23f9\ufe0f \ufe0fThis health check item is not applicable.\") \n      | eval Check=\"Cortex XDR API Validation\" \n      | eval \"Learn More\"=\"Open Documentation\" \n      | append \n          [| search sourcetype=\"pan:*\" earliest=-24h \n          | dedup sourcetype \n          | fields host sourcetype splunk_server \n          | stats list(sourcetype) as sourcetypes by splunk_server \n          | eval invalid_sourcetypes=mvfilter(sourcetypes==\"pan:log\" OR sourcetypes==\"pan:firewall\") \n          | eval severity_level=if(isnull(invalid_sourcetypes), \"0\", \"3\") \n          | eval Check=\"Valid Palo Alto Networks Sourcetypes\" \n          | eval doc_url=\"https://pan.dev/splunk/docs/health-checks/#valid-palo-alto-networks-sourcetypes\"\n          | eval \"Learn More\"=\"Open Documentation\" \n          | eval Results=case(severity_level==\"3\", \"\u2757Invalid sourcetypes detected.\",severity_level==\"0\",\"\u2705 This health check item was successful.\",false(),\"\u23f9\ufe0f This health check item is not applicable.\") ]\n      | append \n          [| search sourcetype=pan:* sourcetype!=\"pan:iot_*\" sourcetype!=\"pan:xdr_incident\" sourcetype!=\"pan:aperture\" sourcetype!=\"pan:firewall_cloud\" \n          | dedup sourcetype \n          | rex field=_raw \"^(?:[^,]*,){6}(?&lt;time_field&gt;[^,]*)\" \n          | eval valid_time=strptime(time_field, \"%Y/%m/%d %H:%M:%S\") \n          | eval severity_level=if(isnull(valid_time), 3, 0) \n          | eval Check=sourcetype.\" Timestamp Compatibility\" \n          | eval doc_url=\"https://pan.dev/splunk/docs/health-checks/#timestamp-compatibility\"\n          | eval \"Learn More\"=\"Open Documentation\" \n          | eval Results=case(severity_level==\"3\", \"\u2757Timestamp format is incorrect. Make sure logs from Firewall or Panorama is sent via syslog BSD with default formatting.\",severity_level==\"0\",\"\u2705 This health check item was successful.\",false(),\"\u23f9\ufe0f This health check item is not applicable.\") ]\n      | append \n          [| search sourcetype=\"pan:*\" latest=+1mon earliest=now \n          | stats count \n          | eval severity_level = case(count &gt; \"0\", 3, count==\"0\", 0, false(), 1) \n          | eval Check=\"Timestamp Validation\" \n          | eval doc_url=\"https://pan.dev/splunk/docs/health-checks/#timestamp-validation\"\n          | eval \"Learn More\"=\"Open Documentation\" \n          | eval Results=case(severity_level==\"3\", \"\u2757Log sourcetypes with timestamps detected in the future.\",severity_level==\"0\",\"\u2705 This health check item was successful.\",false(),\"\u23f9\ufe0f This health check item is not applicable.\") ]\n      | append \n          [| search index=\"_internal\" source=\"/opt/splunk/var/log/python_upgrade_readiness_app/scan_summary/scan_summary.json\" \n          | head 1 \n          | spath output=name {}.name \n          | spath output=scanType {}.scanType \n          | spath output=details {}.details \n          | spath output=status {}.status \n          | eval combined=mvzip(mvzip('name', 'details',\"|\"), mvzip('scanType', 'status', \"|\"), \"|\") \n          | fields combined, host \n          | mvexpand combined \n          | makemv delim=\"|\", combined \n          | eval name=mvindex(combined, 0) \n          | eval details=mvindex(combined,1) \n          | eval scanType=mvindex(combined, 2) \n          | eval status=mvindex(combined, 3) \n          | eval severity_level=case(status==\"BLOCKER\",\"3\",status==\"PASSED\", \"0\") \n          | search scanType=\"appPythonUpradeReadinessScanDetails\" AND (name=\"Splunk_TA_paloalto\" OR name=\"SplunkforPaloAltoNetworks\") \n          | eval Check=name.\" Python 2 Artifacts\" \n          | eval doc_url=\"https://pan.dev/splunk/docs/health-checks/#unsupported-code\"\n          | eval \"Learn More\"=\"Open Documentation\" \n          | eval Results=case(severity_level==\"3\", \"\u2757 \".name.\" is not compatible with Python 3.\",severity_level==\"0\",\"\u2705 This health check item was successful.\",false(),\"\u23f9\ufe0f This health check item is not applicable.\") ]\n      | append \n          [| search index=\"_internal\" source=\"/opt/splunk/var/log/python_upgrade_readiness_app/scan_summary/scan_summary.json\" \n          | head 1 \n          | spath output=name {}.name \n          | spath output=scanType {}.scanType \n          | spath output=details {}.details \n          | spath output=status {}.status \n          | eval combined=mvzip(mvzip('name', 'details',\"|\"), mvzip('scanType', 'status', \"|\"), \"|\") \n          | fields combined, host \n          | mvexpand combined \n          | makemv delim=\"|\", combined \n          | eval name=mvindex(combined, 0) \n          | eval details=mvindex(combined,1) \n          | eval scanType=mvindex(combined, 2) \n          | eval status=mvindex(combined, 3) \n          | eval severity_level=case(status==\"BLOCKER\",\"3\",status==\"PASSED\", \"0\") \n          | search scanType=\"appJqueryUpradeReadinessScanDetails\" AND (name=\"Splunk_TA_paloalto\" OR name=\"SplunkforPaloAltoNetworks\") \n          | eval Check=name.\" jQuery Artifacts\" \n          | eval doc_url=\"https://pan.dev/splunk/docs/health-checks/#unsupported-code\"\n          | eval \"Learn More\"=\"Open Documentation\" \n          | eval Results=case(severity_level==\"3\", \"\u2757 \".name.\" is not compatible with jQuery.\",severity_level==\"0\",\"\u2705 This health check item was successful.\",false(),\"\u23f9\ufe0f This health check item is not applicable.\") ]\n      | append \n          [| search sourcetype=\"pan:firewall_cloud\" earliest=-15m \n          | eval isJSON = if(json_valid(_raw), 0, 1) \n          | stats count by isJSON \n          | eval severity_level=case(isJSON==0 AND count&gt;0, 0, isJSON==1 and count &gt; 0, 3) \n          | eval Check=\"Cortex Log Format\" \n          | eval doc_url=\"https://pan.dev/splunk/docs/health-checks/#cortex-log-format\"\n          | eval \"Learn More\"=\"Open Documentation\" \n          | eval Results = case(severity_level=3, \"\u2757 Invalid JSON detected for Cortex Logs\", severity_level==\"0\",\"\u2705 This health check item was successful.\",false(),\"\u23f9\ufe0f This health check item is not applicable.\") ]\n      | append \n          [| search rest /servicesNS/nobody/SplunkforPaloAltoNetworks/admin/summarization by_tstats=t splunk_server=local count=0 \n          | search eai:acl.app=SplunkforPaloAltoNetworks \n          | eval datamodel=replace('summary.id',\"DM_\".'eai:acl.app'.\"_\",\"\") \n          | stats list(datamodel) as datamodels by splunk_server \n          | eval total_count = mvcount(datamodels) \n          | eval severity_level=case(total_count=\"2\", 0, total_count=\"0\", 3, total_count=\"1\",2) \n          | eval Check=\"Datamodel Acceleration\" \n          | eval doc_url=\"https://pan.dev/splunk/docs/health-checks/#datamodel-acceleration\"\n          | eval \"Learn More\"=\"Open Documentation\" \n          | eval Results=case(severity_level==\"3\", \"\u2757Datamodels are not enabled. \", severity_level=\"2\", \"\u26a0\ufe0f One or more datamodels are not enabled. \", severity_level==\"0\",\"\u2705 This health check item was successful.\",false(),\"\u23f9\ufe0f This health check item is not applicable.\")]\n          | sort Results desc\n    </query>\n  </search>\n  <fieldset autoRun=\"true\" submitButton=\"true\">\n    <input type=\"time\" searchWhenChanged=\"true\" token=\"time\">\n      <label></label>\n      <default>\n        <earliest>-24h@h</earliest>\n        <latest>now</latest>\n      </default>\n    </input>\n  </fieldset>\n  <row>\n    <panel>\n      <single>\n        <search base=\"basesearch\">\n          <query>| stats count</query>\n        </search>\n        <option name=\"colorBy\">trend</option>\n        <option name=\"colorMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"numberPrecision\">0</option>\n        <option name=\"rangeColors\">[\"0x53a051\",\"0x0877a6\",\"0xf8be34\",\"0xf1813f\",\"0xdc4e41\"]</option>\n        <option name=\"rangeValues\">[0,30,70,100]</option>\n        <option name=\"refresh.display\">progressbar</option>\n        <option name=\"showSparkline\">1</option>\n        <option name=\"showTrendIndicator\">1</option>\n        <option name=\"trellis.enabled\">0</option>\n        <option name=\"trellis.scales.shared\">1</option>\n        <option name=\"trellis.size\">medium</option>\n        <option name=\"trendColorInterpretation\">inverse</option>\n        <option name=\"trendInterval\">-1h</option>\n        <option name=\"underLabel\">Total Checks</option>\n        <option name=\"unitPosition\">after</option>\n        <option name=\"useColors\">0</option>\n        <option name=\"useThousandSeparators\">1</option>\n      </single>\n      <single>\n        <search base=\"basesearch\">\n          <query>| stats count(eval(severity_level==0)) as count</query>\n        </search>\n        <option name=\"colorBy\">trend</option>\n        <option name=\"colorMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"numberPrecision\">0</option>\n        <option name=\"rangeColors\">[\"0x53a051\",\"0x53a051\"]</option>\n        <option name=\"rangeValues\">[0]</option>\n        <option name=\"refresh.display\">progressbar</option>\n        <option name=\"showSparkline\">1</option>\n        <option name=\"showTrendIndicator\">1</option>\n        <option name=\"trellis.enabled\">0</option>\n        <option name=\"trellis.scales.shared\">1</option>\n        <option name=\"trellis.size\">medium</option>\n        <option name=\"trendColorInterpretation\">inverse</option>\n        <option name=\"trendInterval\">-1h</option>\n        <option name=\"underLabel\">Pass</option>\n        <option name=\"unitPosition\">after</option>\n        <option name=\"useColors\">1</option>\n        <option name=\"useThousandSeparators\">1</option>\n      </single>\n      <single>\n        <search base=\"basesearch\">\n          <query>| stats count(eval(severity_level==2)) as count</query>\n        </search>\n        <option name=\"colorBy\">trend</option>\n        <option name=\"colorMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"numberPrecision\">0</option>\n        <option name=\"rangeColors\">[\"0xf8be34\",\"0xf8be34\"]</option>\n        <option name=\"rangeValues\">[0]</option>\n        <option name=\"refresh.display\">progressbar</option>\n        <option name=\"showSparkline\">1</option>\n        <option name=\"showTrendIndicator\">1</option>\n        <option name=\"trellis.enabled\">0</option>\n        <option name=\"trellis.scales.shared\">1</option>\n        <option name=\"trellis.size\">medium</option>\n        <option name=\"trendColorInterpretation\">inverse</option>\n        <option name=\"trendInterval\">-1h</option>\n        <option name=\"underLabel\">Warning</option>\n        <option name=\"unitPosition\">after</option>\n        <option name=\"useColors\">1</option>\n        <option name=\"useThousandSeparators\">1</option>\n      </single>\n      <single>\n        <search base=\"basesearch\">\n          <query>| stats count(eval(severity_level==3)) as count</query>\n        </search>\n        <option name=\"colorBy\">trend</option>\n        <option name=\"colorMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"numberPrecision\">0</option>\n        <option name=\"rangeColors\">[\"0xdc4e41\",\"0xdc4e41\"]</option>\n        <option name=\"rangeValues\">[0]</option>\n        <option name=\"refresh.display\">progressbar</option>\n        <option name=\"showSparkline\">1</option>\n        <option name=\"showTrendIndicator\">1</option>\n        <option name=\"trellis.enabled\">0</option>\n        <option name=\"trellis.scales.shared\">1</option>\n        <option name=\"trellis.size\">medium</option>\n        <option name=\"trendColorInterpretation\">inverse</option>\n        <option name=\"trendInterval\">-1h</option>\n        <option name=\"underLabel\">Fail</option>\n        <option name=\"unitPosition\">after</option>\n        <option name=\"useColors\">1</option>\n        <option name=\"useThousandSeparators\">1</option>\n      </single>\n    </panel>\n  </row>\n  <row>\n    <panel>\n      <title>Health Checks</title>\n      <table>\n        <search base=\"basesearch\"></search>\n        <option name=\"count\">15</option>\n        <option name=\"dataOverlayMode\">none</option>\n        <option name=\"drilldown\">cell</option>\n        <option name=\"percentagesRow\">false</option>\n        <option name=\"refresh.display\">progressbar</option>\n        <option name=\"rowNumbers\">false</option>\n        <option name=\"totalsRow\">false</option>\n        <option name=\"wrap\">true</option>\n        <fields>[\"Check\", \"Results\", \"Learn More\"]</fields>\n        <!-- <fields>[\"ID\",\"Severity\",\"Score\",\"Incident Description\",\"Hosts\",\"Status\",\"Assigned To\",\"Incident Sources\",\"XDR Link\"]</fields> -->\n        <drilldown>\n          <condition field=\"Learn More\">\n            <set token=\"inc-doc_url\">$row.doc_url$</set>\n            <link target=\"_blank\">\n              <![CDATA[$row.doc_url|n$]]>\n            </link>\n          </condition>\n        </drilldown>\n      </table>\n    </panel>\n  </row>\n  <row>\n    <panel>\n      <single>\n        <search>\n          <query>sourcetype=\"pan:*\" | stats dc(sourcetype)</query>\n          <earliest>$time.earliest$</earliest>\n          <latest>$time.latest$</latest>\n        </search>\n        <option name=\"colorBy\">trend</option>\n        <option name=\"colorMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"numberPrecision\">0</option>\n        <option name=\"rangeColors\">[\"0x53a051\",\"0x0877a6\",\"0xf8be34\",\"0xf1813f\",\"0xdc4e41\"]</option>\n        <option name=\"rangeValues\">[0,30,70,100]</option>\n        <option name=\"refresh.display\">progressbar</option>\n        <option name=\"showSparkline\">1</option>\n        <option name=\"showTrendIndicator\">1</option>\n        <option name=\"trellis.enabled\">0</option>\n        <option name=\"trellis.scales.shared\">1</option>\n        <option name=\"trellis.size\">medium</option>\n        <option name=\"trendColorInterpretation\">inverse</option>\n        <option name=\"trendInterval\">-1h</option>\n        <option name=\"underLabel\">Sourcetypes</option>\n        <option name=\"unitPosition\">after</option>\n        <option name=\"useColors\">0</option>\n        <option name=\"useThousandSeparators\">1</option>\n      </single>\n    </panel>\n    <panel>\n      <single>\n        <search>\n          <query>index=\"_internal\" log_level=\"ERROR\" pan | stats dc(event_message)</query>\n          <earliest>$time.earliest$</earliest>\n          <latest>$time.latest$</latest>\n        </search>\n        <option name=\"colorBy\">trend</option>\n        <option name=\"colorMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"numberPrecision\">0</option>\n        <option name=\"rangeColors\">[\"0x53a051\",\"0x0877a6\",\"0xf8be34\",\"0xf1813f\",\"0xdc4e41\"]</option>\n        <option name=\"rangeValues\">[0,30,70,100]</option>\n        <option name=\"refresh.display\">progressbar</option>\n        <option name=\"showSparkline\">1</option>\n        <option name=\"showTrendIndicator\">1</option>\n        <option name=\"trellis.enabled\">0</option>\n        <option name=\"trellis.scales.shared\">1</option>\n        <option name=\"trellis.size\">large</option>\n        <option name=\"trendColorInterpretation\">inverse</option>\n        <option name=\"trendInterval\">-1h</option>\n        <option name=\"underLabel\">Internal Error Messages</option>\n        <option name=\"unitPosition\">after</option>\n        <option name=\"useColors\">0</option>\n        <option name=\"useThousandSeparators\">1</option>\n      </single>\n    </panel>\n  </row>\n  <row>\n    <panel>\n      <title>Sourcetypes Detected</title>\n      <table>\n        <search>\n          <query>sourcetype=\"pan:*\" | stats latest(_time) as Time, count by sourcetype | eval Last Seen=strftime(Time,\"%Y-%m-%d %H:%M:%S\") | table sourcetype, count, \"Last Seen\" | sort by count desc</query>\n          <earliest>$time.earliest$</earliest>\n          <latest>$time.latest$</latest>\n        </search>\n      </table>\n    </panel>\n  </row>\n  <row>\n    <panel>\n      <title>Internal Log Error Messages</title>\n      <table>\n        <search>\n          <query>index=\"_internal\" log_level=\"ERROR\" pan | stats count by event_message, source</query>\n          <earliest>$time.earliest$</earliest>\n          <latest>$time.latest$</latest>\n        </search>\n        <option name=\"refresh.display\">progressbar</option>\n      </table>\n    </panel>\n  </row>\n  <row>\n    <panel>\n      <single>\n        <search>\n          <query>| rest /services/apps/local/SplunkforPaloAltoNetworks | fields version</query>\n          <earliest>-24h@h</earliest>\n          <latest>now</latest>\n        </search>\n        <option name=\"drilldown\">none</option>\n        <option name=\"rangeColors\">[\"0x53a051\",\"0x0877a6\",\"0xf8be34\",\"0xf1813f\",\"0xdc4e41\"]</option>\n        <option name=\"underLabel\">App Version</option>\n      </single>\n    </panel>\n    <panel>\n      <single>\n        <search>\n          <query>| rest /services/apps/local/Splunk_TA_paloalto | fields version</query>\n          <earliest>-24h@h</earliest>\n          <latest>now</latest>\n        </search>\n        <option name=\"drilldown\">none</option>\n        <option name=\"rangeColors\">[\"0x53a051\",\"0x0877a6\",\"0xf8be34\",\"0xf1813f\",\"0xdc4e41\"]</option>\n        <option name=\"underLabel\">Add-on Version</option>\n      </single>\n    </panel>\n  </row>\n</form>",
"eai:type": "views",
"name": "health",
"owner": "nobody",
"sharing": "app"
},
{
"eai:data": "<?xml version=\"1.0\"?>\n<view template=\"Splunk_TA_paloalto:templates/base.html\" type=\"html\" isDashboard=\"False\">\n    <label>Inputs</label>\n</view>",
"eai:type": "views",
"name": "inputs",
"owner": "nobody",
"sharing": "app"
}
]
