[
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"host_name\",\"vsys\",\"command\",\"admin\",\"client\",\"result\",\"configuration_path\",\"sequence_number\",\"action_flags\",\"before_change_detail\",\"after_change_detail\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_config",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"src_ip\",\"src_user\",\"vsys\",\"category\",\"severity\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\",\"vsys_id\",\"object\",\"object_id\",\"evidence\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_correlation",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"src_ip\",\"dest_ip\",\"src_translated_ip\",\"dest_translated_ip\",\"rule\",\"src_user\",\"dest_user\",\"app\",\"vsys\",\"src_zone\",\"dest_zone\",\"src_interface\",\"dest_interface\",\"log_forwarding_profile\",\"start_time\",\"session_id\",\"repeat_count\",\"src_port\",\"dest_port\",\"src_translated_port\",\"dest_translated_port\",\"flags\",\"IP_PROTOCOL\",\"action\",\"tunnel_id\",\"future_use2\",\"future_use3\",\"src_vm_uuid\",\"dest_vm_uuid\",\"uuid_rule\",\"stage_client_firewall\",\"stage_firewall_client\",\"tls_version\",\"key_exchange_algorithm\",\"encryption_algorithm\",\"hash_algorithm\",\"rule\",\"elliptic_curve\",\"error_index\",\"root_status\",\"chain_status\",\"proxy_type\",\"cert_serial_number\",\"fingerprint\",\"cert_start_time\",\"cert_end_time\",\"cert_version\",\"cert_size\",\"cn_length\",\"issuer_cn_length\",\"root_cn_length\",\"sni_length\",\"cert_flags\",\"subject_cn\",\"issuer_subject_cn\",\"root_subject_cn\",\"server_name\",\"error\",\"container_id\",\"pod_namespace\",\"pod_name\",\"src_edl\",\"dest_edl\",\"src_dag\",\"dest_dag\",\"timestamp\",\"src_dvc_category\",\"src_dvc_profile\",\"src_dvc_model\",\"src_dvc_vendor\",\"src_dvc_os\",\"src_dvc_os_version\",\"src_name\",\"src_mac\",\"dest_dvc_category\",\"dest_dvc_profile\",\"dest_dvc_model\",\"dest_dvc_vendor\",\"dest_dvc_os\",\"dest_dvc_os_version\",\"dest_name\",\"dest_mac\",\"sequence_number\",\"action_flags\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_decryption",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?<dest_hostname>[^/]*)/",
"SOURCE_KEY": "misc",
"disabled": "0",
"name": "extract_dest_hostname",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?<dest_hostname>[^/]*)/",
"SOURCE_KEY": "URL",
"disabled": "0",
"name": "extract_dest_hostname_cloud",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?:(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\"),){40}(?<eventparam_json>(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\")),",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_eventparam_json",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "(?<file_name>[^/?]*)(?:\\?.*){0,1}$",
"SOURCE_KEY": "misc",
"disabled": "0",
"name": "extract_filename",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?:(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\"),){45}(?<files_json>(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\")),",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_files_json",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "by\\s+user\\s+(?<user>[^,\\s]+)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_general_user",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"future_use2\",\"version\",\"time_generated\",\"vsys\",\"event_id\",\"stage\",\"auth_method\",\"tunnel_type\",\"src_user\",\"src_region\",\"machine_name\",\"public_ip\",\"public_ipv6\",\"private_ip\",\"private_ipv6\",\"host_id\",\"serial_number\",\"client_ver\",\"client_os\",\"client_os_ver\",\"repeat_count\",\"reason\",\"error\",\"opaque\",\"status\",\"location\",\"login_duration\",\"connect_method\",\"error_code\",\"portal\",\"sequence_number\",\"action_flags\",\"event_time\",\"selection_type\",\"response_time\",\"priority\",\"attempted_gateways\",\"gateway\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\",\"vsys_id\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_globalprotect",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "Client version: (?<agent_version>[^,]+)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_globalprotect_clientversion",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "Private IP: (?<src_ip>(?:\\d{1,3}\\.){3}\\d{1,3}+)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_globalprotect_ip",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "Login from: (?<src_ip>(?:\\d{1,3}\\.){3}\\d{1,3}+)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_globalprotect_loginip",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "Message: (?<agent_message>[^,]+)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_globalprotect_message",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "User name: (?<user>[^,]+)(,\\s|\\.$)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_globalprotect_user",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"src_user\",\"vsys\",\"host_name\",\"os\",\"src_ip\",\"hip_name\",\"hip_count\",\"hip_type\",\"future_use3\",\"future_use4\",\"sequence_number\",\"action_flags\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\",\"vsys_id\",\"ipv6_system_address\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_hipmatch",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^\\w*://(?<http_referrer_name>[^/]*)/",
"SOURCE_KEY": "referrer",
"disabled": "0",
"name": "extract_http_referrer_name",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?<major_content_type>[^/]*)/",
"SOURCE_KEY": "content_type",
"disabled": "0",
"name": "extract_major_content_type",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?<major_content_type>[^/]*)/",
"SOURCE_KEY": "ContentType",
"disabled": "0",
"name": "extract_major_content_type_cloud",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?:(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\"),){44}(?<processes_json>(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\")),",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_processes_json",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"vsys\",\"event_id\",\"object\",\"future_use3\",\"future_use4\",\"module\",\"severity\",\"description\",\"sequence_number\",\"action_flags\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_system",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "IP:\\s(?<src_ip>[^,\\s]+)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_system_alert_src",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "Failed password for (?<user>[^\\s]+) from (?<src_ip>[^\\s]+)",
"SOURCE_KEY": "description",
"disabled": "0",
"name": "extract_system_auth",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"src_ip\",\"dest_ip\",\"src_translated_ip\",\"dest_translated_ip\",\"rule\",\"src_user\",\"dest_user\",\"app\",\"vsys\",\"src_zone\",\"dest_zone\",\"src_interface\",\"dest_interface\",\"log_forwarding_profile\",\"future_use3\",\"session_id\",\"repeat_count\",\"src_port\",\"dest_port\",\"src_translated_port\",\"dest_translated_port\",\"session_flags\",\"transport\",\"action\",\"misc\",\"threat\",\"raw_category\",\"severity\",\"direction\",\"sequence_number\",\"action_flags\",\"src_location\",\"dest_location\",\"future_use4\",\"content_type\",\"pcap_id\",\"file_hash\",\"cloud_address\",\"url_index\",\"user_agent\",\"file_type\",\"xff\",\"referrer\",\"sender\",\"subject\",\"recipient\",\"report_id\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\",\"future_use5\",\"src_vm\",\"dest_vm\",\"http_method\",\"tunnel_id\",\"tunnel_monitor_tag\",\"tunnel_session_id\",\"tunnel_start_time\",\"tunnel_type\",\"threat_category\",\"content_version\",\"future_use6\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_threat",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "\\((?<threat_id>\\d+)\\)",
"SOURCE_KEY": "threat",
"disabled": "0",
"name": "extract_threat_id",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "\\((?<threat_id>\\d+)\\)",
"SOURCE_KEY": "ThreatID",
"disabled": "0",
"name": "extract_threat_id_cloud",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?<threat_name>[^(]*)",
"SOURCE_KEY": "threat",
"disabled": "0",
"name": "extract_threat_name",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?<threat_name>[^(]*)",
"SOURCE_KEY": "ThreatID",
"disabled": "0",
"name": "extract_threat_name_cloud",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"src_ip\",\"dest_ip\",\"src_translated_ip\",\"dest_translated_ip\",\"rule\",\"src_user\",\"dest_user\",\"app\",\"vsys\",\"src_zone\",\"dest_zone\",\"src_interface\",\"dest_interface\",\"log_forwarding_profile\",\"future_use3\",\"session_id\",\"repeat_count\",\"src_port\",\"dest_port\",\"src_translated_port\",\"dest_translated_port\",\"session_flags\",\"transport\",\"action\",\"bytes\",\"bytes_out\",\"bytes_in\",\"packets\",\"start_time\",\"duration\",\"http_category\",\"future_use4\",\"sequence_number\",\"action_flags\",\"src_location\",\"dest_location\",\"future_use5\",\"packets_out\",\"packets_in\",\"session_end_reason\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\",\"action_source\",\"src_vm\",\"dest_vm\",\"tunnel_id\",\"tunnel_monitor_tag\",\"tunnel_session_id\",\"tunnel_start_time\",\"tunnel_type\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_traffic",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"record_type\",\"class\",\"future_use1\",\"log_subtype\",\"category\",\"generated_time\",\"server_time\",\"agent_time\",\"tzoffset\",\"future_use2\",\"facility\",\"customer_id\",\"traps_id\",\"server_host\",\"server_component_version\",\"region_id\",\"is_endpoint\",\"agent_id\",\"os_type\",\"is_vdi\",\"os_version\",\"is_64bit\",\"dest_ip\",\"dest_name\",\"dest_nt_domain\",\"severity\",\"agent_version\",\"content_version\",\"protection_status\",\"file_hash\",\"file_type\",\"parent_hash\",\"last_seen\",\"file_name\",\"file_path\",\"file_size\",\"local_analysis_result\",\"reported\",\"blocked\",\"execution_count\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_traps_analytics",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"record_type\",\"class\",\"future_user1\",\"log_subtype\",\"event_type\",\"category\",\"generated_time\",\"server_time\",\"future_use2\",\"facility\",\"customer_id\",\"traps_id\",\"server_host\",\"server_component_version\",\"region_id\",\"is_endpoint\",\"agent_id\",\"log_severity\",\"severity\",\"message_code\",\"friendly_name\",\"future_use3\",\"msg_text_en\",\"additional_data\",\"user_role\",\"logged_in_user\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_traps_config-system",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"record_type\",\"class\",\"future_use1\",\"log_subtype\",\"generated_time\",\"server_time\",\"agent_time\",\"tzoffset\",\"future_use2\",\"facility\",\"customer_id\",\"traps_id\",\"server_host\",\"server_component_version\",\"region_id\",\"is_endpoint\",\"agent_id\",\"os_type\",\"is_vdi\",\"os_version\",\"is_64bit\",\"dest_ip\",\"dest_name\",\"dest_nt_domain\",\"log_severity\",\"severity\",\"agent_version\",\"content_version\",\"protection_status\",\"prevention_key\",\"module_id\",\"profile\",\"module_status_id\",\"verdict\",\"vendor_action\",\"terminate\",\"terminate_target\",\"quarantine\",\"block\",\"post_detected\",\"\",\"source_processes_idx\",\"target_process_idx\",\"file_idx\",\"\",\"\",\"\",\"\",\"description\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_traps_threat",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?:(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\"),){48}(?<threat_name>[^,]*)",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_traps_threat_name",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^.+? - (?<type>[a-z]+)$",
"SOURCE_KEY": "record_type",
"disabled": "0",
"name": "extract_traps_type",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?:[^:]+:\\/\\/)?(?!(?:\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}|\\S+:\\/\\/))(?<url_domain>[^:\\/]+)",
"SOURCE_KEY": "misc",
"disabled": "0",
"name": "extract_url_domain",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?:(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\"),){47}(?<urls_json>(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\")),",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_urls_json",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"DELIMS": "\",\"",
"FIELDS": "\"future_use1\",\"receive_time\",\"serial_number\",\"log_type\",\"log_subtype\",\"version\",\"generated_time\",\"vsys\",\"src_ip\",\"source_name\",\"event_id\",\"repeat_count\",\"timeout_threshold\",\"src_port\",\"dest_port\",\"source\",\"source_type\",\"sequence_number\",\"action_flags\",\"devicegroup_level1\",\"devicegroup_level2\",\"devicegroup_level3\",\"devicegroup_level4\",\"vsys_name\",\"dvc_name\",\"vsys_id\",\"factor_type\",\"factor_completion_time\",\"factor_number\"",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_userid",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^(?:(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\"),){46}(?<users_json>(?:[^\",\\n]*+|\"(?:[^\"]*+|\"\")*\")),",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "extract_users_json",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:analytics_traps",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+? - analytics,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_analytics_traps",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:config",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,CONFIG,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_config",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:config_traps",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+? - config,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_config_traps",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:correlation",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,CORRELATION,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_correlation",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:decryption",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,DECRYPTION,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_decryption",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:globalprotect",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,GLOBALPROTECT,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_globalprotect",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:hipmatch",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,HIPMATCH,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_hipmatch",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:system",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,SYSTEM,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_system",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:system_traps",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+? - system,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_system_traps",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:threat",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,THREAT,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_threat",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:threat_traps",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+? - threat,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_threat_traps",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:traffic",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,TRAFFIC,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_traffic",
"owner": "nobody",
"sharing": "global"
},
{
"CAN_OPTIMIZE": "1",
"CLEAN_KEYS": "1",
"FORMAT": "sourcetype::pan:userid",
"KEEP_EMPTY_VALS": "0",
"MV_ADD": "0",
"REGEX": "^[^,]+,[^,]+,[^,]+,USERID,",
"SOURCE_KEY": "_raw",
"disabled": "0",
"name": "pan_userid",
"owner": "nobody",
"sharing": "global"
}
]
